Revit 2027 API
Curve.IsInside(Double) Method
Indicates whether the specified parameter value is within this curve's bounds.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsInside(
	double parameter
)
Public Function IsInside (
	parameter As Double
) As Boolean
public:
bool IsInside(
	double parameter
)
member IsInside :
        parameter : float -> bool
Parameters
parameter Double
The raw curve parameter to be evaluated.
Return Value
Boolean
True if the parameter is within the bounds, otherwise false.
Exceptions
Exception | Condition
ArgumentException |  Thrown when the specified parameter is infinite.
Remarks
Always returns true if this curve is unbound.
See Also
Reference
Curve Class
IsInside Overload
Autodesk.Revit.DB Namespace